olonsoft/esp8266-Gill-anemometer/src/common.h
#pragma once

#include <arduino.h>
#include <ArduinoJson.h>
#include <FOTA_ESP.h>
#include <FS.h>
#include <WiFiManager.h>  //https://github.com/tzapu/WiFiManager
#include <helper_general.h>
#include <helper_wifi.h>
#include <helper_time.h>
#include <TZ.h>           // for TimeZone define

// needed for justwifi
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <JustWifi.h>
#include <JustWifiUtils.h>
#include <onebutton.h>

struct AppSettings {
  // general
  char     ssid[31];
  char     password[63];
  char     mqttBroker[60];
  uint16_t mqttPort;
  char     mqttUser[20];
  char     mqttPass[63];
  char     mqttTopic[60];               // I use 3 topics /data /stat /cmd
  uint16_t mqttTopicDataInterval;
  uint16_t mqttTopicStatusInterval;
  char     firmwareUpdateServer[80];
  uint16_t firmwareUpdateCheckInterval;
};

AppSettings appSettings = {
    DEFAULT_WIFI1_SSID,                 // wifi to connect
    DEFAULT_WIFI1_PSW,                  // wifi password
    MQTT_BROKER,                        // mqtt broker
    MQTT_PORT,                          // mqtt port
    MQTT_USER,                          // mqtt user
    MQTT_PSW,                           // mqtt password
    MQTT_TOPIC,                         // mqtt topic
    UPDATE_INTERVAL_DATA,               // data topic update interval
    UPDATE_INTERVAL_STATUS,             // status topic update interval
    FIRMWARE_URL,                       // firmware url
    UPDATE_INTERVAL_CHECK_FW            // firmware update check interval
  };

String _crash_post_url = CRASH_POST_URL;

#define SEND_DATA 1

#include <EEPROM.h>
#define EEPROM_SIZE 4096  // EEPROM size in bytes
// #define SPI_FLASH_SEC_SIZE      4096

#define MQTT_ENABLED
#define USE_PUBSUBCLIENT

#ifdef  MQTT_ENABLED

#ifdef  USE_PUBSUBCLIENT
#include <PubSubClient.h>
#else
#include <MQTT.h>
#endif

uint16_t   _mqtt_connections;
bool       _mqtt_connected = false;
const char _topicData[]    PROGMEM = {"data"};
const char _topicStatus[]  PROGMEM = {"stat"};
const char _topicCommand[] PROGMEM = {"cmd"};
const char _topicWind[]    PROGMEM = {"wind"};

const char _statusPayload[] PROGMEM =
    "{\"devi\":\"%s\","
    "\"vers\":\"%s\","
    "\"ssid\":\"%s\","
    "\"pass\":\"%s\","
    "\"bssi\":\"%s\","
    "\"rssi\":%d,"
    "\"ip\":\"%s\","
    "\"time\":\"%s\","
    "\"uptm\":\"%s\","
    "\"memo\":%d,"
    "\"rstr\":\"%s\","
    "\"mbro\":\"%s\","
    "\"mprt\":%d,"
    "\"musr\":\"%s\","
    "\"mpsw\":\"%s\","
    "\"mcnn\":%d,"
    "\"volt\":%.1f"
    "}";


WiFiClient wifiClient;

#ifdef USE_PUBSUBCLIENT
PubSubClient mqttClient(wifiClient);
#else
MQTTClient mqttClient(512);
#endif

#endif  // MQTT_ENABLED

String _status_text = "Starting";

#define OLED1306

#ifdef OLED1306
#include <Wire.h>         // Only needed for Arduino 1.6.5 and earlier

#include "SSD1306Wire.h"  // legacy include: `#include "SSD1306.h"`
// #include <brzo_i2c.h> // Only needed for Arduino 1.6.5 and earlier
// #include "SSD1306Brzo.h"
// Initialize the OLED display using Wire library
SSD1306Wire display(0x3c, D2, D1);

int screenW               = 128;
int screenYH              = 16;   // top yellow part is 16 px height
int screenH               = 64;
bool screenOn             = true;
uint32_t screenOnTime     = 0;
#endif

// ============================== time library ================================

const char *ntpServer = NTP_SERVER;
// timezones: https://remotemonitoringsystems.ca/time-zone-abbreviations.php
#define MY_TIMEZONE TZ_Europe_Athens

// const char *TZ_INFO = "EET-2EEST-3,M3.5.0/03:00:00,M10.5.0/04:00:00";


// =========================== onebutton ======================================

OneButton button1(BUTTON1, true);
uint32_t _longpress_start_time = 0;

//=============================================================================

void _statusReport();  // used later
bool _mqttSendMessage(const char *message);

//=============================================================================

String URLEncode2(const char *msg) {
  const char *hex = "0123456789abcdef";
  String encodedMsg = "";

  while (*msg != '\0') {
    if (('a' <= *msg && *msg <= 'z') || ('A' <= *msg && *msg <= 'Z') ||
        ('0' <= *msg && *msg <= '9')) {
      encodedMsg += *msg;
    } else {
      encodedMsg += '%';
      encodedMsg += hex[*msg >> 4];
      encodedMsg += hex[*msg & 15];
    }
    msg++;
  }
  return encodedMsg;
}

String Value2String(int y) { return !isnan(y) ? String(y) : ""; }

String Value2String(float y) { return !isnan(y) ? String(y) : ""; }

void debugConfig() {
  TLOGDEBUGF_P(
      PSTR("\n[CONFIG] ssid: '%s'\n\t pass: '%s'\n\tBroker: %s\n\tPort: "
           "%d\n\tUser: %s\n\tPass: %s\n\tTopic: %s\n\tmqttInterval: "
           "%d\n\tstatusInterval: %d\n\tOTA server: %s\n\tOTA interval: %d\n"),
      appSettings.ssid, appSettings.password, appSettings.mqttBroker,
      appSettings.mqttPort, appSettings.mqttUser, appSettings.mqttPass,
      appSettings.mqttTopic, appSettings.mqttTopicDataInterval,
      appSettings.mqttTopicStatusInterval, appSettings.firmwareUpdateServer,
      appSettings.firmwareUpdateCheckInterval);
}

// ================================== ESP_FS ==================================

bool formatFS() {
  TLOGDEBUGF_P(PSTR("[ESP_FS] Formatting...\n"));
  if (ESP_FS.format()) {
    TLOGDEBUGF_P(PSTR("[ESP_FS] File system formatted !!!\n"));
    return true;
  } else {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Error formating file system.\n"));
    return false;
  }
}

bool saveConfig() {
  if (!helper_general::beginFileSystem()) return false; // ? I had to mount again FS. Is it a bug?

  DynamicJsonDocument doc(1024);

  doc[F("ssid")] = appSettings.ssid;
  doc[F("pass")] = appSettings.password;
  doc[F("mbro")] = appSettings.mqttBroker;
  doc[F("mpor")] = appSettings.mqttPort;
  doc[F("musr")] = appSettings.mqttUser;
  doc[F("mpsw")] = appSettings.mqttPass;
  doc[F("mtop")] = appSettings.mqttTopic;
  doc[F("mdin")] = appSettings.mqttTopicDataInterval;
  doc[F("msin")] = appSettings.mqttTopicStatusInterval;
  doc[F("usrv")] = appSettings.firmwareUpdateServer;
  doc[F("uint")] = appSettings.firmwareUpdateCheckInterval;

  serializeJsonPretty(doc, Serial);

