olonsoft/esp8266-Gill-anemometer/src/common.h
  File configFile = ESP_FS.open(String(CONFIGFILE), "w");

  if (!configFile) {
    TLOGDEBUGF_P(
        PSTR("[ESP_FS] Failed to open config file [%s] for writing.\n"),
        CONFIGFILE);
    return false;
  }

  debugConfig();

  if (serializeJson(doc, configFile) > 0) {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Configuration saved to File System.\n"));
  } else {
    TLOGDEBUGF_P(
        PSTR("[ESP_FS] Error saving configuration to File System.\n"));
    return false;
  }

  configFile.close();
  return true;
}

bool loadConfig() {
  TLOGDEBUGF_P(PSTR("[ESP_FS] Loading config from file [%s].\n"), CONFIGFILE);
  if (!helper_general::beginFileSystem()) return false;

  if (!ESP_FS.exists(String(CONFIGFILE))) {
    TLOGDEBUGF_P(PSTR("Config file does not exist. Creating default. [%s]\n"),
                  CONFIGFILE);
    return (saveConfig());
  }

  File configFile = ESP_FS.open(String(CONFIGFILE), "r");
  if (!configFile) {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Failed to open config file [%s].\n"),
                  CONFIGFILE);
    return false;
  }

  size_t size = configFile.size();
  TLOGDEBUGF_P(PSTR("[ESP_FS] Config file size: %d\n"),size);

  if (size > 1024) {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Config file size is too large.\n"));
    return false;
  }

  const size_t capacity = ESP.getFreeHeap() - 3096;
  DynamicJsonDocument doc(capacity);
  // Deserialize the JSON document
  DeserializationError error = deserializeJson(doc, configFile);
  if (error) {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Failed to parse config file. Error: %s\n"),
                  error.c_str());
    return false;
  }

  configFile.close();

  serializeJsonPretty(doc, Serial);

  // @todo check if values are null before copying
  strlcpy(appSettings.ssid, doc[F("ssid")] | appSettings.ssid,
          sizeof(appSettings.ssid));
  strlcpy(appSettings.password, doc[F("pass")] | appSettings.password,
          sizeof(appSettings.password));
  strlcpy(appSettings.mqttBroker, doc[F("mbro")] | appSettings.mqttBroker,
          sizeof(appSettings.mqttBroker));
  appSettings.mqttPort = doc[F("mpor")] | appSettings.mqttPort;
  strlcpy(appSettings.mqttUser, doc[F("musr")] | appSettings.mqttUser,
          sizeof(appSettings.mqttUser));
  strlcpy(appSettings.mqttPass, doc[F("mpsw")] | appSettings.mqttPass,
          sizeof(appSettings.mqttPass));
  strlcpy(appSettings.mqttTopic, doc[F("mtop")] | appSettings.mqttTopic,
          sizeof(appSettings.mqttTopic));
  appSettings.mqttTopicDataInterval =
      doc[F("mdin")] | appSettings.mqttTopicDataInterval;
  appSettings.mqttTopicStatusInterval =
      doc[F("msin")] | appSettings.mqttTopicStatusInterval;
  strlcpy(appSettings.firmwareUpdateServer,
          doc[F("usrv")] | appSettings.firmwareUpdateServer,
          sizeof(appSettings.firmwareUpdateServer));
  appSettings.firmwareUpdateCheckInterval =
      doc[F("uint")] | appSettings.firmwareUpdateCheckInterval;
  debugConfig();
  return true;
}

bool deleteConfig() {
  if (!helper_general::beginFileSystem()) return false; // ? I had to mount again FS. Is it a bug?

  if (!ESP_FS.exists(String(CONFIGFILE))) {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Config file [%s] does not exist.\n"),
                  CONFIGFILE);
    return false;
  }

  TLOGDEBUGF_P(PSTR("[ESP_FS] Deleting config file [%s].\n"), CONFIGFILE);

  if (ESP_FS.remove(String(CONFIGFILE))) {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Config File deleted.\n"));
    return true;
  } else {
    TLOGDEBUGF_P(PSTR("[ESP_FS] Can not delete Config File.\n"));
    return false;
  }
}

/*  todo: have to check those functions
//
https://github.com/G6EJD/Using-ESP8266-EEPROM/blob/master/ESP8266_Reading_and_Writing_EEPROM.ino/
//
https://arduino.stackexchange.com/questions/25945/how-to-read-and-write-eeprom-in-esp8266

// Loads string from EEPROM. Returns length of string read.
int loadFlashString(uint16_t startAt, char* buffer, size_t maxLen)
{
    EEPROM.begin(EEPROM_SIZE);
    uint16_t i = 0;
    {
        buffer[i] = (char)EEPROM.read(startAt + i);
        Serial.println(buffer[i]);
    } while(i < maxLen && buffer[i++] != 0);
    Serial.println(buffer);
    EEPROM.end();
    if (i >= maxLen) {
        return -1;
    }
    return i;
}

// Saves string to EEPROM. Returns index position after end of string.
int saveFlashString(uint16_t startAt, const String& id)
{
    uint16_t len = id.length();
    if (len == 0) return -1;
    EEPROM.begin(EEPROM_SIZE);
    for (uint16_t i = 0; i <= len; i++)
    {
        EEPROM.write(i + startAt, (uint8_t) id.c_str()[i]);
    }
    EEPROM.write(startAt + len, 0);
    EEPROM.commit();
    EEPROM.end();
    return startAt + len;
}

int saveFlashWiFi(const String& ssid, const String& pass) {
    uint16_t lenSSID = ssid.length();
    uint16_t lenPass = pass.length();
    if (lenSSID > 31 || lenPass > 63) return -1; // invalid ssid or password
    EEPROM.begin(EEPROM_SIZE);

    // ssid starts at 0. Max is 31 + #0 (31 is the max because 0 is first)
    uint16_t i;
    for (i = 0; i <= lenSSID; i++)
    {
        EEPROM.write(i, (uint8_t) ssid.c_str()[i]);
        Serial.println(ssid.c_str()[i]);
    }
    EEPROM.write(lenSSID, 0);

    // pass starts at 32
    uint16_t j;
    for (j = 0; j<=lenPass; j++) {
        EEPROM.write(32+j, (uint8_t) pass.c_str()[j]);
        Serial.println(ssid.c_str()[j]);
    }
    EEPROM.write(32+lenPass, 0);

    EEPROM.commit();
    EEPROM.end();
    return (i+j);
}

*/

// FOTA section
void onFOTAMessage(fota_t t, char *msg) {
  _mqttSendMessage(msg);
  TLOGDEBUG(msg);
}

void FOTA_Setup() {
  String server = helper_general::addMacAddress(String(appSettings.firmwareUpdateServer));
  server = helper_general::addTrailingSlash(server);
  FOTAClient.setFOTAParameters(server.c_str(), "firmware.json",
                               APP_VERSION, APP_VERSION);
  FOTAClient.onMessage(onFOTAMessage);
}

void FOTA_Loop() {

  if (WiFi.status() != WL_CONNECTED) return;

  static uint32_t last_check = 0;
  if (helper_time::timeReached(last_check)) {
    helper_time::setNextTimeInterval(last_check, appSettings.firmwareUpdateCheckInterval * 1000);
    FOTAClient.checkAndUpdateFOTA(true);
  }

