olonsoft/esp8266-Gill-anemometer/src/common.h
}
// =============================== just wifi start =============================

void jwSetup() {
  jw.setHostname(APP_NAME);  // Set WIFI hostname (otherwise it would be ESP_XXXXXX)

  // Callbacks
  jw.subscribe(infoCallback);
  jw.subscribe(mdnsCallback);
  // AP mode only as fallback
  //jw.enableAP(false);
  jw.enableAPFallback(false);

  // Enable STA mode (connecting to a router)
  jw.enableSTA(true);

  // Configure it to scan available networks and connect in order of dBm
  jw.enableScan(true);

  // Clean existing network configuration
  jw.cleanNetworks();

  WiFi.printDiag(Serial);

  // Add internal esp8266 saved wifi network
  //jw.addCurrentNetwork(true);
  // Add wifi network saved in settings
  jw.addNetwork(appSettings.ssid, appSettings.password);
  // add additional wifi networks
  jw.addNetwork("Yianna Caravel", "2810824724");
  jw.addNetwork("ikaros3", "ikaros2021");
  jw.addNetwork("Support", "12345678");
  // Add an open network
  jw.addNetwork("open");
}

// ============================================================================

void restartESP() {
  ESP_FS.end();  // unmount file system before restart
  delay(1000);
  // ESP.reset();    // is a hard reset and can leave some of the registers in
  // the old state which can lead to problems, its more or less like the reset
  // button on the PC.
  ESP.restart();  // tells the SDK to reboot, so its a more clean reboot, use
                  // this one if possible.
  delay(5000);
}

void resetESP() {
  TLOGDEBUGF_P(PSTR("[RESET] Reset to factory defaults.\n"));
  deleteConfig();
  delay(1000);
  restartESP();
}

// ----- button 1 callback functions

// This function will be called when the button1 was pressed 1 time
void click1() {
  Serial.println("Button 1 click.");
#ifdef OLED1306
  screenOn = true;
  screenOnTime = millis();
  display.displayOn();
#endif
}  // click1

// This function will be called when the button1 was pressed 2 times in a short
// timeframe.
void doubleclick1() {
  Serial.println("Button 1 doubleclick.");
}  // doubleclick1

// This function will be called once, when the button1 is pressed for a long
// time.
void longPressStart1() {
  Serial.println("Button 1 longPress start");
  _longpress_start_time = millis();
}  // longPressStart1

// This function will be called often, while the button1 is pressed for a long
// time.
void longPress1() {
  // Serial.println("Button 1 longPress...");
}  // longPress1

// This function will be called once, when the button1 is released after beeing
// pressed for a long time.
void longPressStop1() {
  Serial.println("Button 1 longPress stop");
  if (helper_time::timePassedSince(_longpress_start_time) > 5000) {
    resetESP();
  }
}  // longPressStop1

// ===================== setupOneButton =============
void oneButtonSetup() {
  // link the button 1 functions.
  button1.attachClick(click1);
  button1.attachDoubleClick(doubleclick1);
  button1.attachLongPressStart(longPressStart1);
  button1.attachLongPressStop(longPressStop1);
  button1.attachDuringLongPress(longPress1);
}

#ifdef OLED1306

void initSSD1306() {
  display.init();
  display.flipScreenVertically();
  display.setContrast(255);
}

void _drawWifiQuality(int8_t quality) {
  display.setColor(BLACK);
  display.fillRect(83, 0, 44, 15);
  display.setColor(WHITE);
  display.setTextAlignment(TEXT_ALIGN_RIGHT);
  display.setFont(ArialMT_Plain_10);
  if (WiFi.isConnected()) {
    display.drawString(119, 0, String(WiFi.RSSI()) + "dBm");
    for (int8_t i = 0; i < 4; i++) {
      for (int8_t j = 0; j < 2 * (i + 1); j++) {
        if (quality > i * 25 || j == 0) {
          display.setPixel(121 + 2 * i, 9 - j);
        }
      }
    }
  } else {
    display.drawString(58, 0, F("-----"));
  }
  //display.drawLine(83, 15, 128, 15);
  display.drawLine(0, 15, 127, 15);
}

void _oledUpdateStatusText() {

  display.setColor(BLACK);
  display.fillRect(0, 0, 82, 15);
  display.setColor(WHITE);
  display.setTextAlignment(TEXT_ALIGN_LEFT);
  if (_status_text == "") {
    if (millis()%6000 < 3000) {
      _status_text = WiFi.localIP().toString();
    } else {
      _status_text = WiFi.SSID();
    }
  }
  display.setFont(ArialMT_Plain_10);
  display.drawString(0, 0, _status_text);

  //display.drawLine(0, 16, 82, 16);
  static unsigned long last_check = 0;
  if ((last_check > 0) && ((millis() - last_check) < 3000)) return;
  last_check = millis();
  _status_text = "";
}

#endif

// =============================== MQTT ===============================

#ifdef MQTT_ENABLED


void _mqttOnMessage(char *topic, char *payload, unsigned int len) {
  if (len == 0) return;

  char message[len + 1];
  strlcpy(message, (char *)payload, len + 1);
  message[len] = '\0';
  TLOGDEBUGF_P(PSTR("%sTopic: %s \tIncoming Message: %s\n"), MQTT_STR, topic, message);

  char *command = strtok(message, " ");

  if (strcmp("status", command) == 0) {
    // send status report
    _statusReport();
    return;
  };

  if (strcmp("reset", command) == 0) {
    _mqttSendMessage("Reseting...");
    delay(2000);
    resetESP();
    delay(5000);
    return;
  }

  if (strcmp("format", command) == 0) {
    _mqttSendMessage("Reseting...");
    delay(2000);
    formatFS();
    delay(5000);
    return;
  }

  if (strcmp("restart", command) == 0) {
    _mqttSendMessage("Restarting...");
    delay(2000);
    ESP.restart();
    delay(5000);
    return;
  }

  if (strcmp("update", command) == 0) {
    FOTAClient.checkAndUpdateFOTA(true);
    return;
  }

  if (strcmp("broker", command) == 0) {  // command is: broker user:password@domain_or_ip:port
    char *userid = strtok(nullptr, ":");
    char *password = strtok(nullptr, "@");
    char *url = strtok(nullptr, ":");
    char *port = strtok(nullptr, "");

    if (userid != nullptr) {
      if (strcmp("*", userid) > 0) {  // if user or password is blank, use *
        appSettings.mqttUser[0] = 0;
      } else {
        strcpy(appSettings.mqttUser, userid);
      }
    }

    if (password != nullptr) {
      if (strcmp("*", password) > 0) {
        appSettings.mqttPass[0] = 0;
      } else {
        strcpy(appSettings.mqttPass, password);
      }
    }
    if (url != nullptr) {
      strcpy(appSettings.mqttBroker, url);
    }
    if (port != nullptr) {
      appSettings.mqttPort = atoi(port);
    }
    debugConfig();
    _mqttSendMessage("Saving new broker.");
    saveConfig();
    return;
  }

