olonsoft/esp8266-Gill-anemometer/src/common.h
  if (strcmp("interval", command) == 0) {
    char *value = strtok(nullptr, "");
    if (value != nullptr) {
      appSettings.mqttTopicDataInterval = atoi(value);
      _mqttSendMessage("Saving new interval.");
      saveConfig();
      return;
    }
  }
}

#ifdef USE_PUBSUBCLIENT
void mqttCallback(char *topic, byte *payload, unsigned int length) {
  // handle message arrived
  _mqttOnMessage(topic, (char *)payload, length);
}
#else
void mqttCallback(String &topic, String &payload) {
  // handle message arrived
  _mqttOnMessage(const_cast<char *>(topic.c_str()),
                 const_cast<char *>(payload.c_str()), payload.length());
}
#endif

bool mqttConnect() {
  if (WiFi.status() != WL_CONNECTED) {
    TLOGDEBUGF_P(PSTR("%sNo WiFi connection \n"), MQTT_STR);
    return (_mqtt_connected = false);
  }
  //TLOGDEBUGF_P(PSTR("%sConnecting to MQTT... \n"), MQTT_STR);
  _mqtt_connected = mqttClient.connected();
  if (!_mqtt_connected) {
    TLOGDEBUGF_P(PSTR("%sConnecting to: \n\t%s\n\tPort: %d\n\tUser: "
                       "%s\n\tpass: %s\n"), MQTT_STR,
                  appSettings.mqttBroker, appSettings.mqttPort,
                  appSettings.mqttUser, appSettings.mqttPass);
    String clientId = (char *)APP_NAME;
    clientId += "-" + helper_general::getChipIdHex();
#ifdef USE_PUBSUBCLIENT
    mqttClient.setServer(appSettings.mqttBroker, appSettings.mqttPort);
    mqttClient.setCallback(mqttCallback);
#else
    mqttClient.begin(appSettings.mqttBroker, appSettings.mqttPort, wifiClient);
    mqttClient.onMessage(mqttCallback);
#endif
    String lwt_topic = helper_general::addMacAddress(String(appSettings.mqttTopic));
    lwt_topic = helper_general::addTrailingSlash(lwt_topic) + F("LWT");

    if (mqttClient.connect(clientId.c_str(), appSettings.mqttUser,
                           appSettings.mqttPass, lwt_topic.c_str(), 1, true, "offline")) {
      _mqtt_connections++;
      mqttClient.publish(lwt_topic.c_str(), "online", true);

      TLOGDEBUGF_P(PSTR("%sConnected.\n"), MQTT_STR);
      String topic = helper_general::addMacAddress(String(appSettings.mqttTopic));
      topic = helper_general::addTrailingSlash(topic) + FPSTR(_topicCommand);
      TLOGDEBUGF_P(PSTR("%sSubscribing to topic %s\n"), MQTT_STR, topic.c_str());
      mqttClient.subscribe(topic.c_str());
      _mqtt_connected = true;
    } else {
      int err = 0;
#ifdef USE_PUBSUBCLIENT
      err = mqttClient.state();
#else
      err = int(mqttClient.lastError());
#endif
      TLOGDEBUGF_P(PSTR("%sConnection failed] rc = %d\n"), MQTT_STR, err);
    }
  } else {
    //TLOGDEBUGF_P(PSTR("%sAlready connected.\n"), MQTT_STR);
  }
  return _mqtt_connected;
}

bool _mqttSendMessage(const char *message) {
  bool result = false;
  String topic = "";
  if (mqttConnect()) {
    _status_text = "Sending...";
    topic = helper_general::addMacAddress(String(appSettings.mqttTopic));
    topic = helper_general::addTrailingSlash(topic) + FPSTR(_topicStatus);
    result = (mqttClient.publish(topic.c_str(), message) == true);
  }
  if (result) {
    TLOGDEBUGF_P(PSTR("%sSuccess sending message to topic: %s\n"), MQTT_STR, topic.c_str());
  } else {
    TLOGDEBUGF_P(PSTR("%sError sending message to topic: %s\n"), MQTT_STR, topic.c_str());
  }
  return result;
}

void _statusReport() {
  int v = analogRead(A0);
  float volt = map(v, 0, 1024, 0, 135) / 10.0f;
  char buffer[400] = {};
  snprintf_P(buffer, sizeof(buffer), _statusPayload, (char *)APP_NAME,
             (char *)APP_VERSION, WiFi.SSID().c_str(),
             "*****",  // WiFi.psk().c_str(),
             WiFi.BSSIDstr().c_str(), WiFi.RSSI(),
             WiFi.localIP().toString().c_str(),
             helper_time::timeToString().c_str(),
             helper_time::getUpTimeString().c_str(),
             ESP.getFreeHeap(),
             String(ESP.getResetReason()).c_str(),
             String(appSettings.mqttBroker).c_str(),
             appSettings.mqttPort,
             String(appSettings.mqttUser).c_str(),
             "*****",  // String(appSettings.mqttPass).c_str(),
             _mqtt_connections,
             volt);

  LOGDEBUGF("\n%sBuffer: %s\n", MQTT_STR,  buffer);

  _mqttSendMessage(buffer);
}

void _statusReportLoop() {

  if (WiFi.status() != WL_CONNECTED) return;
  if (appSettings.mqttTopicStatusInterval == 0) return;

  static uint32_t last_status_report = 0;
  if (helper_time::timeReached(last_status_report)) {
    helper_time::setNextTimeInterval(last_status_report, appSettings.mqttTopicStatusInterval * 1000);
    _statusReport();
  }

}

void mqttLoop() {
  if (WiFi.status() != WL_CONNECTED) return;
  static uint32_t loop_delay = 0;
  if (helper_time::timeReached(loop_delay)) {         // Not need to call .loop() so often.
    helper_time::setNextTimeInterval(loop_delay, 50); // Every 50ms is enough

    if (!mqttClient.loop()) {
      static uint32_t last_mqtt_check = 0;

      if (helper_time::timeReached(last_mqtt_check)) {
        helper_time::setNextTimeInterval(last_mqtt_check, 10000);
        TLOGDEBUGF_P(PSTR("%s(mqttloop) Not connected. Reconnecting.\n"), MQTT_STR);
        mqttConnect();
      }
    } else {
      _statusReportLoop();
    }

  }
}

#endif

void initialize() {
  _crash_post_url = helper_general::addMacAddress(_crash_post_url);

  // check file system
  TLOGDEBUGF_P(PSTR("[DEBUG] Checking file system.\n"));
  helper_general::beginFileSystem();
  TLOGDEBUGF_P(PSTR("[DEBUG] Print default configuration:\n"));
  debugConfig();

  // loading configuration
  loadConfig();

#ifdef OLED1306
  initSSD1306();
#endif

  TLOGDEBUGF_P("[DEBUG] Printing info:\n");
  TLOGDEBUGLN(helper_general::getSystemInfoJson());

  TLOGDEBUGF_P("[DEBUG] Setup oneButton.\n");
  oneButtonSetup();

  // setup wifi
  TLOGDEBUGF_P("[DEBUG] Setup wifi.\n");
  jwSetup();

  // setup OTA updates
  TLOGDEBUGF_P("[DEBUG] Setup FOTA updater.\n");
  FOTA_Setup();

  // start time client
  // ! move it after wifi connection.
  TLOGDEBUGF_P("[DEBUG] Starting ntp client.\n");
  configTime(MY_TIMEZONE, ntpServer);  // updated for > 2.7.0
  //configTime(0, 0, ntpServer);
  //setenv("TZ", TZ_INFO, 1);
  //tzset();  // save the TZ variable

  // Give now a chance to the settimeofday callback,
  // because it is *always* deferred to the next yield()/loop()-call.
  yield();
}

void startWiFiManager() {
  TLOGDEBUGF_P("Starting wifi manager.\n");
  char buf[6];
  buf[0] = 0;
  WiFiManagerParameter custom_mqtt_broker("server", "mqtt server",
                                          appSettings.mqttBroker, 60);
  WiFiManagerParameter custom_mqtt_port("port", "mqtt port",
                                        itoa(appSettings.mqttPort, buf, 10), 6);
  WiFiManagerParameter custom_mqtt_user("user", "mqtt user",
                                        appSettings.mqttUser, 60);
  WiFiManagerParameter custom_mqtt_password("password", "mqtt password",
                                            appSettings.mqttPass, 60);
  WiFiManagerParameter custom_mqtt_topic("topic", "mqtt topic",
                                         appSettings.mqttTopic, 60);
  buf[0] = '\0';
  WiFiManagerParameter custom_mqtt_update("update", "update in secs",
      itoa(appSettings.mqttTopicDataInterval, buf, 10), 6);
  WiFiManager wifiManager;
  // wifiManager.resetSettings(); //reset settings - for testing
  // add all your parameters here
  wifiManager.addParameter(&custom_mqtt_broker);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_mqtt_user);
  wifiManager.addParameter(&custom_mqtt_password);
  wifiManager.addParameter(&custom_mqtt_topic);
  wifiManager.addParameter(&custom_mqtt_update);

  wifiManager.setTimeout(120);  //(in seconds) sets timeout until configuration
                                //portal gets turned off

  // it starts an access point with the specified name
  // and goes into a blocking loop awaiting configuration

  if (!wifiManager.startConfigPortal((char *)APP_NAME)) {
    TLOGDEBUGF_P("failed to connect and hit timeout\n");
    restartESP();
  }
  // if you get here you have connected to the WiFi
  TLOGDEBUGF_P("connected...yeey :)\n");
  WiFi.printDiag(Serial);
  // save SSID and password to flash
  strcpy(appSettings.ssid, WiFi.SSID().c_str());
  strcpy(appSettings.password, WiFi.psk().c_str());
  // save mqtt settings to flash
  strcpy(appSettings.mqttBroker, custom_mqtt_broker.getValue());
  appSettings.mqttPort = atoi(custom_mqtt_port.getValue());
  strcpy(appSettings.mqttUser, custom_mqtt_user.getValue());
  strcpy(appSettings.mqttPass, custom_mqtt_password.getValue());
  strcpy(appSettings.mqttTopic, custom_mqtt_topic.getValue());
  appSettings.mqttTopicDataInterval = atoi(custom_mqtt_update.getValue());
  debugConfig();
  saveConfig();  // save configuration and restart esp
  restartESP();
}

void wifiLoop() {
  if (!captivePortal) {
    jw.loop();
    if (jw.connected()) {
      FOTA_Loop();  // check for firmware updates
    }
  } else {
    startWiFiManager();
  }
}
